# Внимание: Программа - без учета ошибок!
# Поэтому необходимо отвечать на вопросы внимательно!

print('Личностный опросник Ганса Айзенка (EPQ).')
print('Данный опросник был создан в 1968 году.\n')
print('Данный тест поможет Вам выяснить свой темперамент,\n и узнать насколько Вы эмоционально стабильны.\n')

print('Всего 101 вопрос.\n')

name = input('Как вас зовут?')
print('Привет,', name, '\n')

answer1 = input('1. У вас много различных хобби? +/-')
answer2 = input('2. Вы обдумываете предварительно то, что собираетесь сделать? +/-')
answer3 = input('3. У Вас часто бывают спады и подъемы настроения? +/-')
answer4 = input('4. Вы претендовали когда-нибудь на похвалу за то, что в действительности сделал другой человек? +/-')
answer5 = input('5. Вы разговорчивый человек? +/-')
answer6 = input('6. Вас беспокоило бы то, что Вы залезли в долги? +/-')
answer7 = input('7. Вам приходилось чувствовать себя несчастным человеком без особых на то причин? +/-')
answer8 = input('8. Вам случалось когда-нибудь пожадничать, чтобы получить больше, чем Вам полагалось? +/-')
answer9 = input('9. Вы тщательно запираете дверь на ночь? +/-')
answer10 = input('10. Вы считаете себя жизнерадостным человеком? +/-')
answer11 = input('11. Увидев, как страдает ребенок, животное, Вы бы сильно расстроились? +/-')
answer12 = input('12. Вы часто переживаете из-за того, что сделали или сказали что-то, чего не следовало бы делать или говорить? +/-')
answer13 = input('13. Вы всегда исполняете свои обещания, даже если лично Вам это очень неудобно? +/-')
answer14 = input('14. Вы получили бы удовольствие прыгая с парашютом? +/-')
answer15 = input('15. Способны ли Вы дать волю чувствам и от души повеселиться в шумной компании? +/-')
answer16 = input('16. Вы раздражительны? +/-')
answer17 = input('17. Вы когда-нибудь обвиняли кого-нибудь в том, в чем на самом деле были виноваты Вы сами? +/-')
answer18 = input('18. Вам нравится знакомиться с новыми людьми? +/-')
answer19 = input('19. Вы верите в пользу страхования? +/-')
answer20 = input('20. Легко ли Вас обидеть? +/-')
answer21 = input('21. Все ли Ваши привычки хороши и желательны? +/-')
answer22 = input('22. Вы стараетесь быть в тени, находясь в обществе? +/-')
answer23 = input('23. Стали  бы  Вы  принимать  средства,  которые  могут  привести  Вас  в необычное или опасное состояние (алкоголь, наркотики)? +/-')
answer24 = input('24. Вы часто испытываете такое состояние, когда все надоело? +/-')
answer25 = input('25. Вам случалось брать вещи, принадлежащие другому лицу, будь это даже такая мелочь, как булавка или пуговица? +/-')
answer26 = input('26. Вам нравится часто ходить к кому-нибудь в гости и бывать в обществе? +/-')
answer27 = input('27. Вам доставляет удовольствие обижать тех, кого Вы любите? +/-')
answer28 = input('28. Вас часто беспокоит чувство вины? +/-')
answer29 = input('29. Вам приходилось говорить о том, в чем Вы плохо разбираетесь? +/-')
answer30 = input('30. Вы обычно предпочитаете книги встречам с людьми? +/-')
answer31 = input('31. У Вас есть явные враги? +/-')
answer32 = input('32. Вы назвали бы себя нервным человеком? +/-')
answer33 = input('33. Вы всегда извиняетесь, когда нагрубите другому? +/-')
answer34 = input('34. У Вас много друзей? +/-')
answer35 = input('35. Вам  нравится  устраивать  розыгрыши  и  шутки,  которые  иногда  могут действительно причинить людям боль? +/-')
answer36 = input('36. Вы беспокойный человек? +/-')
answer37 = input('37. В детстве Вы всегда безропотно и немедленно выполняли то, что Вам приказывали? +/-')
answer38 = input('38. Вы считаете себя беззаботным человеком? +/-')
answer39 = input('39. Много ли для Вас значат хорошие манеры и чистоплотность? +/-')
answer40 = input('40. Волнуетесь ли Вы по поводу каких-либо ужасных событий, которые могли бы случиться, но не случились? +/-')
answer41 = input('41. Вам случалось сломать или потерять чужую вещь? +/-')
answer42 = input('42. Вы обычно первыми проявляете инициативу при знакомстве? +/-')
answer43 = input('43. Можете ли Вы легко понять состояние человека, если он делится с Вами заботами? +/-')
answer44 = input('44. У Вас часто нервы бывают натянуты до предела? +/-')
answer45 = input('45. Бросите ли Вы ненужную бумажку на пол, если под рукой нет корзины? +/-')
answer46 = input('46. Вы больше молчите, находясь в обществе других людей? +/-')
answer47 = input('47. Считаете ли Вы, что брак старомоден, и его следует отменить? +/-')
answer48 = input('48. Вы иногда чувствуете жалость к себе? +/-')
answer49 = input('49. Вы иногда много хвастаетесь? +/-')
answer50 = input('50. Вы легко можете внести оживление в довольно скучную компанию? +/-')
answer51 = input('51. Раздражают ли Вас осторожные водители? +/-')
answer52 = input('52. Вы беспокоитесь о своем здоровье? +/-')
answer53 = input('53. Вы говорили когда-нибудь плохо о другом человеке? +/-')
answer54 = input('54. Вы любите пересказывать анекдоты и шутки своим друзьям? +/-')
answer55 = input('55. Для Вас большинство пищевых продуктов одинаковы на вкус? +/-')
answer56 = input('56. Бывает ли у Вас иногда дурное настроение? +/-')
answer57 = input('57. Вы дерзили когда-нибудь своим родителям в детстве? +/-')
answer58 = input('58. Вам нравится общаться с людьми? +/-')
answer59 = input('59. Вы переживаете, если узнаете, что допустили ошибки в своей работе? +/-')
answer60 = input('60. Вы страдаете от бессонницы? +/-')
answer61 = input('61. Вы всегда моете руки перед едой? +/-')
answer62 = input('62. Вы из тех людей, которые не лезут за словом в карман? +/-')
answer63 = input('63. Вы предпочитаете приходить на встречу немного раньше назначенного срока? +/-')
answer64 = input('64. Вы чувствуете себя апатичным, усталым, без какой-либо причины? +/-')
answer65 = input('65. Вам нравится работа, требующая быстрых действий? +/-')
answer66 = input('66. Вы так любите поговорить, что не упускаете любого  удобного случая побеседовать с новым человеком? +/-')
answer67 = input('67. Ваша мать - хороший человек (была хорошим человеком)? +/-')
answer68 = input('68. Часто ли Вам кажется, что жизнь ужасно скучна? +/-')
answer69 = input('69. Вы когда-нибудь воспользовались оплошностью другого человека в своих целях? +/-')
answer70 = input('70. Вы часто берете на себя больше, чем позволяет время? +/-')
answer71 = input('71. Есть ли люди, которые стараются избегать Вас? +/-')
answer72 = input('72. Вас очень заботит Ваша внешность? +/-')
answer73 = input('73. Вы всегда вежливы, даже с неприятными людьми? +/-')
answer74 = input('74. Считаете ли Вы, что люди затрачивают слишком много времени, чтобы обеспечить свое будущее, откладывая сбережения, страхуя себя и свою жизнь? +/-')
answer75 = input('75. Возникало ли у Вас когда-нибудь желание умереть? +/-')
answer76 = input('76. Вы попытались бы избежать уплаты налога с дополнительного заработка, если бы были уверены, что Вас никогда не смогут уличить в этом? +/-')
answer77 = input('77. Вы можете внести оживление в компанию? +/-')
answer78 = input('78. Вы стараетесь не грубить людям? +/-')
answer79 = input('79. Вы долго переживаете после случившегося конфуза? +/-')
answer80 = input('80. Вы когда-нибудь настаивали на том, чтобы было по-вашему? +/-')
answer81 = input('81. Вы  часто  приезжаете  на  вокзал  в  последнюю  минуту  перед  отходом поезда? +/-')
answer82 = input('82. Вы когда-нибудь намеренно говорили что-нибудь неприятное или обидное для человека? +/-')
answer83 = input('83. Вас беспокоили Ваши нервы? +/-')
answer84 = input('84. Вам  неприятно  находиться  среди  людей,  которые  подшучивают  над товарищами? +/-')
answer85 = input('85. Вы легко теряете друзей по своей вине? +/-')
answer86 = input('86. Вы часто испытываете чувство одиночества? +/-')
answer87 = input('87. Всегда ли Ваши слова совпадают с делом? +/-')
answer88 = input('88. Нравится ли Вам иногда дразнить животных? +/-')
answer89 = input('89. Вы  легко  обижаетесь  на  замечания,  касающиеся  лично  Вас  и  Вашей работы? +/-')
answer90 = input('90. Жизнь без какой-либо опасности показалась бы Вам слишком скучной? +/-')
answer91 = input('91. Вы когда-нибудь опаздывали на свидание или работу? +/-')
answer92 = input('92. Вам нравится суета и оживление вокруг Вас? +/-')
answer93 = input('93. Вы хотите, чтобы люди боялись Вас? +/-')
answer94 = input('94. Верно ли, что Вы иногда полны энергии и все горит в руках, а иногда совсем вялы? +/-')
answer95 = input('95. Вы иногда откладываете на завтра то, что должны сделать сегодня? +/-')
answer96 = input('96. Считают ли Вас живым и веселым человеком? +/-')
answer97 = input('97. Часто ли Вам говорят неправду? +/-')
answer98 = input('98. Вы очень чувствительны к некоторым явлениям, событиям, вещам? +/-')
answer99 = input('99. Вы всегда готовы признавать свои ошибки? +/-')
answer100 = input('100. Вам когда-нибудь было жалко животное, которое попало в капкан? +/-')
answer101 = input('101. Трудно ли Вам было заполнять анкету? +/-')
print ('Тест окончен! \n')




# 1. Шкала психотизма:

if answer2=='-': # Здесь "-" = "правильный" ответ
    b2 = 1
elif answer2=='+':
    b2 = 0
else:
    b2 = 0

if answer6=='-':
    b6 = 1
elif answer2=='+':
    b6 = 0
else:
    b6 = 0

if answer9=='-':
    b9 = 1
elif answer9=='+':
    b9 = 0
else:
    b9 = 0

if answer11=='-':
    b11 = 1
elif answer11=='+':
    b11 = 0
else:
    b11 = 0

if answer19=='-':
    b19 = 1
elif answer19=='+':
    b19 = 0
else:
    b19 = 0

if answer39=='-':
    b39 = 1
elif answer39=='+':
    b39 = 0
else:
    b39 = 0

if answer43=='-':
    b43 = 1
elif answer43=='+':
    b43 = 0
else:
    b43 = 0

if answer59=='-':
    b59 = 1
elif answer59=='+':
    b59 = 0
else:
    b59 = 0

if answer63=='-':
    b63 = 1
elif answer63=='+':
    b63 = 0
else:
    b63 = 0

if answer67=='-':
    b67 = 1
elif answer67=='+':
    b67 = 0
else:
    b67 = 0

if answer78=='-':
    b78 = 1
elif answer78=='+':
    b78 = 0
else:
    b78 = 0

if answer100=='-':
    b100 = 1
elif answer100=='+':
    b100 = 0
else:
    b100 = 0

if answer14=='+': # Здесь "+" = "правильный" ответ
    b14 = 1
elif answer14=='-':
    b14 = 0
else:
    b14 = 0

if answer23=='+':
    b23 = 1
elif answer23=='-':
    b23 = 0
else:
    b23 = 0

if answer27=='+':
    b27 = 1
elif answer27=='-':
    b27 = 0
else:
    b27 = 0

if answer31=='+':
    b31 = 1
elif answer31=='-':
    b31 = 0
else:
    b31 = 0

if answer35=='+':
    b35 = 1
elif answer35=='-':
    b35 = 0
else:
    b35 = 0

if answer47=='+':
    b47 = 1
elif answer47=='-':
    b47 = 0
else:
    b47 = 0

if answer51=='+':
    b51 = 1
elif answer51=='-':
    b51 = 0
else:
    b51 = 0

if answer55=='+':
    b55 = 1
elif answer55=='-':
    b55 = 0
else:
    b55 = 0

if answer71=='+':
    b71 = 1
elif answer71=='-':
    b71 = 0
else:
    b71 = 0

if answer85=='+':
    b85 = 1
elif answer85=='-':
    b85 = 0
else:
    b85 = 0

if answer88=='+':
    b88 = 1
elif answer88=='-':
    b88 = 0
else:
    b88 = 0

if answer93=='+':
    b93 = 1
elif answer93=='-':
    b93 = 0
else:
    b93 = 0

if answer97=='+':
    b97 = 1
elif answer97=='-':
    b97 = 0
else:
    b97 = 0

summ_1scale = (b2+b6+b9+b11+b19+b39+b43+b59+b63+b67+b78+b100 + b14+b23+b27+b31+b35+b47+b51+b55+b71+b85+b88+b93+b97)
print ('Средние значения по шкале психотизма: 5-12.')
print ('Ваш балл по шкале психотизма: ', summ_1scale, '\n')






# 2. Шкала экстраверсии-интроверсии:

if answer22=='-': # Здесь "-" = "правильный" ответ
    b22 = 1
elif answer22=='+':
    b22 = 0
else:
    b22 = 0

if answer30=='-': 
    b30 = 1
elif answer30=='+':
    b30 = 0
else:
    b30 = 0

if answer46=='-': 
    b46 = 1
elif answer46=='+':
    b46 = 0
else:
    b46 = 0

if answer84=='-': 
    b84 = 1
elif answer84=='+':
    b84 = 0
else:
    b84 = 0

if answer1=='+': # Здесь "+" = "правильный" ответ
    b1 = 1
elif answer1=='-':
    b1 = 0
else:
    b1 = 0

if answer3=='+': 
    b3 = 1
elif answer3=='-':
    b3 = 0
else:
    b3 = 0

if answer10=='+': 
    b10 = 1
elif answer10=='-':
    b10 = 0
else:
    b10 = 0

if answer15=='+': 
    b15 = 1
elif answer15=='-':
    b15 = 0
else:
    b15 = 0

if answer18=='+': 
    b18 = 1
elif answer18=='-':
    b18 = 0
else:
    b18 = 0

if answer26=='+': 
    b26 = 1
elif answer26=='-':
    b26 = 0
else:
    b26 = 0

if answer34=='+': 
    b34 = 1
elif answer34=='-':
    b34 = 0
else:
    b34 = 0

if answer38=='+': 
    b38 = 1
elif answer38=='-':
    b38 = 0
else:
    b38 = 0

if answer42=='+': 
    b42 = 1
elif answer42=='-':
    b42 = 0
else:
    b42 = 0

if answer50=='+': 
    b50 = 1
elif answer50=='-':
    b50 = 0
else:
    b50 = 0

if answer54=='+': 
    b54 = 1
elif answer54=='-':
    b54 = 0
else:
    b54 = 0

if answer58=='+': 
    b58 = 1
elif answer58=='-':
    b58 = 0
else:
    b58 = 0

if answer62=='+': 
    b62 = 1
elif answer62=='-':
    b62 = 0
else:
    b62 = 0

if answer66=='+': 
    b66 = 1
elif answer66=='-':
    b66 = 0
else:
    b66 = 0

if answer70=='+': 
    b70 = 1
elif answer70=='-':
    b70 = 0
else:
    b70 = 0

if answer74=='+': 
    b74 = 1
elif answer74=='-':
    b74 = 0
else:
    b74 = 0

if answer77=='+': 
    b77 = 1
elif answer77=='-':
    b77 = 0
else:
    b77 = 0

if answer81=='+': 
    b81 = 1
elif answer81=='-':
    b81 = 0
else:
    b81 = 0

if answer90=='+': 
    b90 = 1
elif answer90=='-':
    b90 = 0
else:
    b90 = 0

if answer92=='+': 
    b92 = 1
elif answer92=='-':
    b92 = 0
else:
    b92 = 0

if answer96=='+': 
    b96 = 1
elif answer96=='-':
    b96 = 0
else:
    b96 = 0


summ_2scale = (b22+b30+b46+b84 + b1+b3+b10+b15+b18+b26+b34+b38+b42+b50+b54+b58+b62+b66+b70+b74+b77+b81+b90+b92+b96)
print ('Средние показатели по шкале экстро-интроверсии: 7-15 баллов.')
print ('Высокие  оценки  по  шкале  экстраверсия-интроверсия   соответствуют   экстравертированному   типу,   низкие —интравертированному. ')
print ('Ваш балл по шкале экстро-интроверсии: ', summ_2scale, '\n')







# 3. Шкала нейротизма:

if answer3=='+': # Здесь "+" = "правильный" ответ
    n3 = 1
elif answer3=='-':
    n3 = 0
else:
    n3 = 0

if answer7=='+': 
    n7 = 1
elif answer7=='-':
    n7 = 0
else:
    n7 = 0

if answer12=='+': 
    n12 = 1
elif answer12=='-':
    n12 = 0
else:
    n12 = 0

if answer16=='+': 
    n16 = 1
elif answer16=='-':
    n16 = 0
else:
    n16 = 0

if answer20=='+': 
    n20 = 1
elif answer20=='-':
    n20 = 0
else:
    n20 = 0

if answer24=='+': 
    n24 = 1
elif answer24=='-':
    n24 = 0
else:
    n24 = 0

if answer28=='+': 
    n28 = 1
elif answer28=='-':
    n28 = 0
else:
    n28 = 0

if answer32=='+': 
    n32 = 1
elif answer32=='-':
    n32 = 0
else:
    n32 = 0

if answer36=='+': 
    n36 = 1
elif answer36=='-':
    n36 = 0
else:
    n36 = 0

if answer40=='+': 
    n40 = 1
elif answer40=='-':
    n40 = 0
else:
    n40 = 0

if answer44=='+': 
    n44 = 1
elif answer44=='-':
    n44 = 0
else:
    n44 = 0

if answer48=='+': 
    n48 = 1
elif answer48=='-':
    n48 = 0
else:
    n48 = 0

if answer52=='+': 
    n52 = 1
elif answer52=='-':
    n52 = 0
else:
    n52 = 0

if answer56=='+': 
    n56 = 1
elif answer56=='-':
    n56 = 0
else:
    n56 = 0

if answer60=='+': 
    n60 = 1
elif answer60=='-':
    n60 = 0
else:
    n60 = 0

if answer64=='+': 
    n64 = 1
elif answer64=='-':
    n64 = 0
else:
    n64 = 0

if answer68=='+': 
    n68 = 1
elif answer68=='-':
    n68 = 0
else:
    n68 = 0

if answer72=='+': 
    n72 = 1
elif answer72=='-':
    n72 = 0
else:
    n72 = 0

if answer75=='+': 
    n75 = 1
elif answer75=='-':
    n75 = 0
else:
    n75 = 0

if answer79=='+': 
    n79 = 1
elif answer79=='-':
    n79 = 0
else:
    n79 = 0

if answer83=='+': 
    n83 = 1
elif answer83=='-':
    n83 = 0
else:
    n83 = 0

if answer86=='+': 
    n86 = 1
elif answer86=='-':
    n86 = 0
else:
    n86 = 0

if answer89=='+': 
    n89 = 1
elif answer89=='-':
    n89 = 0
else:
    n89 = 0

if answer94=='+': 
    n94 = 1
elif answer94=='-':
    n94 = 0
else:
    n94 = 0

if answer98=='+': 
    n98 = 1
elif answer98=='-':
    n98 = 0
else:
    n98 = 0

summ_3scale = (n3+n7+n12+n16+n20+n24+n28+n32+n36+n40+n44+n48+n52+n56+n60+n64+n68+n72+n75+n79+n83+n86+n89+n94+n98)
print ('Средние показатели по шкале нейротизма: 8-16.')
print ('Ваш балл по шкале нейротизма: ', summ_3scale, '\n')






# 4. Шкала искренности:

if answer4=='-': # Здесь "-" = "правильный" ответ
    i4 = 1
elif answer4=='+':
    i4 = 0
else:
    i4 = 0

if answer8=='-': 
    i8 = 1
elif answer8=='+':
    i8 = 0
else:
    i8 = 0

if answer17=='-': 
    i17 = 1
elif answer17=='+':
    i17 = 0
else:
    i17 = 0

if answer25=='-': 
    i25 = 1
elif answer25=='+':
    i25 = 0
else:
    i25 = 0

if answer29=='-': 
    i29 = 1
elif answer29=='+':
    i29 = 0
else:
    i29 = 0

if answer41=='-': 
    i41 = 1
elif answer41=='+':
    i41 = 0
else:
    i41 = 0

if answer45=='-': 
    i45 = 1
elif answer45=='+':
    i45 = 0
else:
    i45 = 0

if answer49=='-': 
    i49 = 1
elif answer49=='+':
    i49 = 0
else:
    i49 = 0

if answer53=='-': 
    i53 = 1
elif answer53=='+':
    i53 = 0
else:
    i53 = 0

if answer57=='-': 
    i57 = 1
elif answer57=='+':
    i57 = 0
else:
    i57 = 0

if answer65=='-': 
    i65 = 1
elif answer65=='+':
    i65 = 0
else:
    i65 = 0

if answer69=='-': 
    i69 = 1
elif answer69=='+':
    i69 = 0
else:
    i69 = 0

if answer76=='-': 
    i76 = 1
elif answer76=='+':
    i76 = 0
else:
    i76 = 0

if answer80=='-': 
    i80 = 1
elif answer80=='+':
    i80 = 0
else:
    i80 = 0

if answer82=='-': 
    i82 = 1
elif answer82=='+':
    i82 = 0
else:
    i82 = 0

if answer91=='-': 
    i91 = 1
elif answer91=='+':
    i91 = 0
else:
    i91 = 0

if answer95=='-': 
    i95 = 1
elif answer95=='+':
    i95 = 0
else:
    i95 = 0

if answer13=='+': # Здесь "+" = "правильный" ответ
    i13 = 1
elif answer13=='-':
    i13 = 0
else:
    i13 = 0

if answer21=='+': 
    i21 = 1
elif answer21=='-':
    i21 = 0
else:
    i21 = 0

if answer33=='+': 
    i33 = 1
elif answer33=='-':
    i33 = 0
else:
    i33 = 0

if answer37=='+': 
    i37 = 1
elif answer37=='-':
    i37 = 0
else:
    i37 = 0

if answer61=='+': 
    i61 = 1
elif answer61=='-':
    i61 = 0
else:
    i61 = 0

if answer73=='+': 
    i73 = 1
elif answer73=='-':
    i73 = 0
else:
    i73 = 0

if answer87=='+': 
    i87 = 1
elif answer87=='-':
    i87 = 0
else:
    i87 = 0

if answer99=='+': 
    i99 = 1
elif answer99=='-':
    i99 = 0
else:
    i99 = 0

summ_4scale = (i4+i8+i17+i25+i29+i41+i45+i49+i53+i57+i65+i69+i76+i80+i82+i91+i95 + i13+i21+i33+i37+i61+i73+i87+i99)
print ('Если по шкале искренности количество баллов превышает 10, то результаты обследования  считаются  недостоверными  и  испытуемому  следует  отвечать  на вопросы более откровенно.')
print ('Ваш балл по шкале искренности: ', summ_4scale, '\n')





# А теперь графическое представление данных:

from tkinter import*
app=Tk()
app.title('Визуализация результатов')
c = Canvas(app, height=500, width=500)
c.pack()

# Это квадранты темпераментов:
m = c.create_rectangle(0,0,250,250, fill='lightblue')
h = c.create_rectangle(250,0,500,250, fill='pink')
f = c.create_rectangle(0,250,250,500, fill='lightgreen')
s = c.create_rectangle(250,250,500,500, fill='yellow')

words_m = c.create_text(125, 125, text = 'Меланхолик', font=('Times', 22))
words_h = c.create_text(375, 125, text = 'Холерик', font=('Times', 22))
words_f = c.create_text(125, 375, text = 'Флегматик', font=('Times', 22))
words_s = c.create_text(375, 375, text = 'Сангвиник', font=('Times', 22))

words_i = c.create_text(75, 260, text = 'интроверсия', font=('Times', 18), fill = 'blue')
words_e = c.create_text(425, 260, text = 'экстраверсия', font=('Times', 18), fill = 'blue')

words_nst = c.create_text(250, 25, text = 'нестабильность', font=('Times', 18), fill = 'green')
words_st = c.create_text(250, 475, text = 'стабильность', font=('Times', 18), fill = 'green')


# y - это горизонтальные линии (горизонтальная разметка)!
y0=c.create_line(0,0,500,0, fill='red')

# x - это вертикальные линии (вертикальная разметка)!
x0=c.create_line(0,0,0,500, fill='red')

n2=20*summ_2scale
c.move(x0, n2, 0)

n3=500-(20*summ_3scale)
c.move(y0, 0, n3)

'''
ОБРАБОТКА ДАННЫХ:

При обработке опросника полученные результаты ответов сопоставляются с «ключом».

- За  ответ,  соответствующий  ключу,  присваивается  1  балл,
- за несоответствующий ключу — 0 баллов.

Полученные баллы суммируются отдельно по каждой шкале.
'''

